{
    "1. Company name": "Dandy",
    "2. Position name": "Senior Machine Learning & Computer Vision Engineer",
    "3. Seniority level": "Not explicitly mentioned, but implied to be senior due to the job title and requirements",
    "4. Joining date": "Not specified",
    "5. Team name": "Machine Learning & Computer Vision team",
    "6. Location": "Remote",
    "7. Salary": "$210K - $232.5K",
    "8. Hybrid or Remote?": "Remote",
    "9. What does the company do?": "Dandy is transforming the dental industry through technology and innovation, aiming to integrate and simplify every function of a dental practice.",
    "10. What does the team do?": "The team tackles problems involving 3D geometric computer vision, generative deep learning, and SOTA machine learning methods.",
    "11. List of job responsibilities": "Building Computer Vision models, researching SOTA methods, working with product and research teams, developing evaluation methods, implementing best practices for MLOps pipelines, and delivering value quickly to Dandy's customers.",
    "12. Skills that are preferred to have": "Experience in Python, 2D Deep Learning, 3D geometric Computer Vision, and 3D Deep Learning (preferred).",
    "13. Skills that are absolutely required to have": "Not explicitly stated, but experience with Pytorch is mentioned as a requirement for the job.",
    "14. Exceptional skills the team would appreciate": "Immaculate attention to detail and delivering excellent code and results.",
    "15. Technical keywords relevant to the job role": "Machine Learning, Computer Vision, Python, PyTorch, 2D Deep Learning, 3D geometric Computer Vision, 3D Deep Learning.",
    "16. Necessary experience": "4+ years of experience, with 3+ years in ML.",
    "17. Bonus experience": "Experience with massive datasets and fine-tuning models for specific applications.",
    "18. Job role classification": "Machine Learning Engineer, Computer Vision Engineer",
    "19. Company values": "Dandy is proud to be an equal-opportunity employer, committed to building a diverse and inclusive culture that celebrates authenticity to win as one.",
    "20. Benefits": "Healthcare, dental, parental planning, mental health benefits, 401(k) plan, paid time off.",
    "21. Soft skills required": "Not explicitly stated, but experience with feature-focused teams and delivering value quickly is implied."
}